get_ua_num = """✍️Напишите ваш номер телефона который желаете пополнить.

              Например: +380687354328"""

get_es_num = """✍️Напишите ваш номер телефона который желаете пополнить.

              Например: +34612345678"""

internet = """RostNet\nПополнение от 100₽ до 15000₽\nС комиссией 20%"""
partner = """⚡️Лучший VPN - @ProxyTGPay_bot

🚀eSIM для интернета - @smsactive2_bot

💬Накрутка и продвижение в социальных сетях - @socprodvizhenie_bot

❤️Анонимный чат знакомства - @AnonimChatLoveTG_bot"""


get_ru_num = """✍️Напишите ваш номер телефона который желаете пополнить.

    Например: +79363836372"""
akk = """✍️Чтобы купить донат напишите нашему специалисту

      Пример :
      CS:GO
      Ранг : Global
      Часов в игре 500"""
esim = """eSIM - это виртуальная сим-карта, по работоспособности ничем не отличается от физической пластиковой сим-карты.
      Но, к сожалению, не все устройства поддерживают данную технологию.
      ✍️ Чтобы узнать, поддерживает ли ваше устройство eSIM, напишите нам @TGPaySupport_bot.
      ▫️ Подробнее о eSIM можно почитать в <a href="https://telegra.ph/eSIM-04-23-3">этой статье</a>."""


tarifs = {
'VodafoneTarif':"""👩‍💻ХАРАКТЕРИСТИКИ

⚡️Интернет 4G + 25 ГБ интернета + БЕЗЛИМИТНЫЙ трафик на 38 приложений❕
🎁Первый месяц бесплатно❕
💳Абонплата, 230 грн/4 недели❕
📱Безлимит на звонки внутри сети Vodafone❕
📞Звонки на других операторов 1200 мин на все сети по Украине❕
<b>Цена: 3000 р.</b>""",


'КиевстарTarif':"""👩‍💻ХАРАКТЕРИСТИКИ

⚡️Мобильный интернет безлимит.
📱Звонки в сети Киевстар
безлимит.
📞Звонки на другие мобильные, городские и за границу
275 мин
💳Абонплата 275грн/месяц
<b>Цена: 3000 р.</b>""",


'LifecellTarif':"""👩‍💻ХАРАКТЕРИСТИКИ

⚡️Интернет безлимит
⭐️Безлимит на соцсети
📱Звонки в сети lifecell безлимит
☎️Звонки на других операторов 1600 минут
💳Абонплата 325 грн в месяц
🎁Первый месяц включён!
<b>Цена: 3000 р.</b>""",
}

rules = """1. Внутренний баланс

1.1 Чтобы купить товар или оплатить услугу, нужно пополнить внутренний баланс бота.
1.2 Возврат денежных средств осуществляется только на внутренний баланс бота, за исключением случаев, указанных в п. 2.3.
1.3 Перед переводом средств пользователь обязан проверить актуальность реквизитов. В случае если пользователь ошибся в платёжных реквизитах (номер карты, номер кошелька), возврат не предусмотрен!
1.4 Пользователь уведомлён, что вывод денежных средств с внутреннего баланса бота не осуществляется, за исключением случаев, указанных в п. 2.3.
1.5 Максимальные задержки при пополнении мобильного могут составлять до 24 часов.

2. Гарантия

2.1 Гарантия действует 2 недели на весь товар и 40 дней на все услуги с момента покупки.
2.2 Возврат рабочего товарa невозможен!
2.3 Если товар не был получен в течение 7 дней с момента оплаты, пользователь имеет право запросить возврат средств на реквизиты, с которых была произведена оплата. Для этого необходимо:

Обратиться в поддержку с заявлением о возврате.

Предоставить номер заказа и квитанцию об оплате.

Указать реквизиты для возврата (если они отличаются от исходных).
2.4 Возврат средств на реквизиты осуществляется в течение 7 рабочих дней с момента одобрения заявки.
2.5 Возврат на внутренний баланс бота осуществляется в течение 1 рабочего дня с момента обращения.

3. Поддержка

3.1 Пользователь обязан проверить актуальность контактов поддержки.
3.2 Сообщение в поддержку должно быть оформлено строго по форме:

Краткое описание проблемы с товаром/услугой.

Номер заявки.

Квитанция об оплате (если проблема с пополнением внутреннего баланса).

4. Политика конфиденциальности

4.1 Мы не храним и не передаём третьим лицам данные платёжных реквизитов пользователей (номера карт, электронных кошельков и т.д.).
4.2 Все данные, связанные с транзакциями, используются исключительно для обработки заказов и возвратов.
4.3 Пользователь соглашается с тем, что его данные (номер заказа, история транзакций) могут храниться для учёта и решения спорных ситуаций.

5. Неактивные балансы и благотворительность (новый раздел)

5.1 Средства на внутреннем балансе считаются неактивными, если в течение 12 месяцев подряд пользователь не совершал никаких операций (покупка услуг, запрос в поддержку, действия по использованию баланса).

5.2 По истечении 12 месяцев неактивности внутренний баланс пользователя автоматически списывается и передаётся на благотворительность от имени пользователей сервиса TGPay.

5.3 Списание неактивного баланса является безвозвратным, и возврат таких средств пользователю невозможен, независимо от срока, прошедшего после списания.

5.4 Пользователь соглашается с тем, что самостоятельно контролирует активность своего аккаунта и своевременно использует средства на внутреннем балансе.

5.5 Данные правила действуют с момента их публикации и не имеют обратной силы 22.11.2025"""